# ExportPDFPages

## Description
This will export the current document to PDF.  You must call OpenPDFDocument before calling this function.  This is intended to support Batch Export to PDF.

```pascal
FUNCTION ExportPDFPages(savedViewNameStr : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.ExportPDFPages(savedViewNameStr):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|savedViewNameStr|DYNARRAY[] of CHAR||

## Version
Availability: from VectorWorks12.5
## Category
* Command